nc: 6
scales: 
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]     #0
  - [-1, 1, Conv, [128, 3, 2]]    #1
  - [-1, 1, SEBlock, [128]]       #2
  - [-1, 3, C2f, [128, True]]     #3
  - [-1, 1, Conv, [256, 3, 2]]    #4
  - [-1, 1, SEBlock, [256]]       #5
  - [-1, 6, C2f, [256, True]]     #6 join H-18
  - [-1, 1, SCDown, [512, 3, 2]]  #7
  - [-1, 1, SEBlock, [512]]       #8
  - [-1, 6, C2f, [512, True]]     #9 join H-15
  - [-1, 1, SCDown, [1024, 3, 2]] #10
  - [-1, 3, C2f, [1024, True]]    #11
  - [-1, 1, SPPF, [1024, 5]]      #12
  - [-1, 1, PSA, [1024]]          #13 join H-24

head: 
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  #14
  - [[-1, 9], 1, Concat, [1]] # join B-9        #15
  - [-1, 3, C2f, [512]]                         #16

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  #17
  - [[-1, 6], 1, Concat, [1]] # join B-6        #18
  - [-1, 3, C2f, [256]]                         #19

  - [-1, 1, Conv, [256, 3, 2]]                  #20
  - [[-1, 16], 1, Concat, [1]] # join H-16      #21
  - [-1, 3, C2f, [512]]                         #22

  - [-1, 1, SCDown, [512, 3, 2]]                #23
  - [[-1, 13], 1, Concat, [1]] # join B-13      #24
  - [-1, 3, C2fCIB, [1024, True, True]]         #25
  
  - [[19, 22, 25], 1, v10Detect, [nc]]